#### Terraform Plan
```
data.aws_iam_policy_document.lambda_assume: Reading...
aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/simple-lambda-dev]
aws_ecr_repository.this: Refreshing state... [id=simple-lambda-dev]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_iam_role.lambda: Refreshing state... [id=simple-lambda-dev-role]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=simple-lambda-dev-role-20260228224719217500000001]
aws_lambda_function.this: Refreshing state... [id=simple-lambda-dev]
aws_lambda_invocation.oneoff["run_bob_es"]: Refreshing state... [id=simple-lambda-dev_$LATEST_09be35eaefac42f6ba2a6655931e8df5]
aws_lambda_invocation.oneoff["run_alice"]: Refreshing state... [id=simple-lambda-dev_$LATEST_bc5a63b4b3a296eb7d1a9faead994e5b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron["cron_charlie_fr"] will be created
  + resource "aws_cloudwatch_event_rule" "cron" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "simple-lambda-dev-cron_charlie_fr"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + state               = "ENABLED"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.cron["cron_charlie_fr"] will be created
  + resource "aws_cloudwatch_event_target" "cron" {
      + arn            = "arn:aws:lambda:us-east-1:637423251679:function:simple-lambda-dev"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + emoji    = true
              + greeting = "bonjour"
              + language = "fr"
              + name     = "Charlie"
              + title    = null
            }
        )
      + rule           = "simple-lambda-dev-cron_charlie_fr"
      + target_id      = (known after apply)
    }

  # aws_lambda_permission.cron["cron_charlie_fr"] will be created
  + resource "aws_lambda_permission" "cron" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "simple-lambda-dev"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowEventBridge-cron_charlie_fr"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cron_rule_arns       = {
      + cron_charlie_fr = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```